dos1/flow3r-firmware/components/micropython/vendor/ports/esp32/machine_pin.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * Development of the code in this file was sponsored by Microbric Pty Ltd
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2016 Damien P. George
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include <stdio.h>
#include <string.h>

#include "driver/gpio.h"
#include "driver/rtc_io.h"
#include "hal/gpio_ll.h"

#include "py/runtime.h"
#include "py/mphal.h"
#include "mphalport.h"
#include "modmachine.h"
#include "extmod/virtpin.h"
#include "machine_rtc.h"
#include "modesp32.h"

#if CONFIG_IDF_TARGET_ESP32C3
#include "soc/usb_serial_jtag_reg.h"
#endif

// Used to implement a range of pull capabilities
#define GPIO_PULL_DOWN (1)
#define GPIO_PULL_UP   (2)

#if CONFIG_IDF_TARGET_ESP32
#define GPIO_FIRST_NON_OUTPUT (34)
#elif CONFIG_IDF_TARGET_ESP32S2
#define GPIO_FIRST_NON_OUTPUT (46)
#endif

typedef struct _machine_pin_obj_t {
    mp_obj_base_t base;
    gpio_num_t id;
} machine_pin_obj_t;

typedef struct _machine_pin_irq_obj_t {
    mp_obj_base_t base;
    gpio_num_t id;
} machine_pin_irq_obj_t;

STATIC const machine_pin_obj_t machine_pin_obj[GPIO_NUM_MAX] = {
    #if CONFIG_IDF_TARGET_ESP32

    {{&machine_pin_type}, GPIO_NUM_0},
    {{&machine_pin_type}, GPIO_NUM_1},
    {{&machine_pin_type}, GPIO_NUM_2},
    {{&machine_pin_type}, GPIO_NUM_3},
    {{&machine_pin_type}, GPIO_NUM_4},
    {{&machine_pin_type}, GPIO_NUM_5},
    {{&machine_pin_type}, GPIO_NUM_6},
    {{&machine_pin_type}, GPIO_NUM_7},
    {{&machine_pin_type}, GPIO_NUM_8},
    {{&machine_pin_type}, GPIO_NUM_9},
    {{&machine_pin_type}, GPIO_NUM_10},
    {{&machine_pin_type}, GPIO_NUM_11},
    {{&machine_pin_type}, GPIO_NUM_12},
    {{&machine_pin_type}, GPIO_NUM_13},
    {{&machine_pin_type}, GPIO_NUM_14},
    {{&machine_pin_type}, GPIO_NUM_15},
    #if CONFIG_ESP32_SPIRAM_SUPPORT
    {{NULL}, -1},
    {{NULL}, -1},
    #else
    {{&machine_pin_type}, GPIO_NUM_16},
    {{&machine_pin_type}, GPIO_NUM_17},
    #endif
    {{&machine_pin_type}, GPIO_NUM_18},
    {{&machine_pin_type}, GPIO_NUM_19},
    {{&machine_pin_type}, GPIO_NUM_20},
    {{&machine_pin_type}, GPIO_NUM_21},
    {{&machine_pin_type}, GPIO_NUM_22},
    {{&machine_pin_type}, GPIO_NUM_23},
    {{NULL}, -1},
    {{&machine_pin_type}, GPIO_NUM_25},
    {{&machine_pin_type}, GPIO_NUM_26},
    {{&machine_pin_type}, GPIO_NUM_27},
    {{NULL}, -1},
    {{NULL}, -1},
    {{NULL}, -1},
    {{NULL}, -1},
    {{&machine_pin_type}, GPIO_NUM_32},
    {{&machine_pin_type}, GPIO_NUM_33},
    {{&machine_pin_type}, GPIO_NUM_34},
    {{&machine_pin_type}, GPIO_NUM_35},
    {{&machine_pin_type}, GPIO_NUM_36},
    {{&machine_pin_type}, GPIO_NUM_37},
    {{&machine_pin_type}, GPIO_NUM_38},
    {{&machine_pin_type}, GPIO_NUM_39},

    #elif CONFIG_IDF_TARGET_ESP32C3

    {{&machine_pin_type}, GPIO_NUM_0},
    {{&machine_pin_type}, GPIO_NUM_1},
    {{&machine_pin_type}, GPIO_NUM_2},
    {{&machine_pin_type}, GPIO_NUM_3},
    {{&machine_pin_type}, GPIO_NUM_4},
    {{&machine_pin_type}, GPIO_NUM_5},
    {{&machine_pin_type}, GPIO_NUM_6},
    {{&machine_pin_type}, GPIO_NUM_7},
    {{&machine_pin_type}, GPIO_NUM_8},
    {{&machine_pin_type}, GPIO_NUM_9},
    {{&machine_pin_type}, GPIO_NUM_10},
    {{&machine_pin_type}, GPIO_NUM_11},
    {{&machine_pin_type}, GPIO_NUM_12},
    {{&machine_pin_type}, GPIO_NUM_13},
    {{NULL}, -1}, // 14 FLASH
    {{NULL}, -1}, // 15 FLASH
    {{NULL}, -1}, // 16 FLASH
    {{NULL}, -1}, // 17 FLASH
    #if CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG
    {{NULL}, -1}, // 18 is for native USB D-
    {{NULL}, -1}, // 19 is for native USB D+
    #else
    {{&machine_pin_type}, GPIO_NUM_18},
    {{&machine_pin_type}, GPIO_NUM_19},
    #endif
    {{&machine_pin_type}, GPIO_NUM_20},
    {{&machine_pin_type}, GPIO_NUM_21},

	#elif CONFIG_FLOW3R_ESP32S3

    {{NULL}, -1}, // 0
    {{NULL}, -1}, // 1
    {{NULL}, -1}, // 2
    {{NULL}, -1}, // 3
    {{&machine_pin_type}, GPIO_NUM_4}, // Badgelink
    {{&machine_pin_type}, GPIO_NUM_5}, // Badgelink
    {{&machine_pin_type}, GPIO_NUM_6}, // Badgelink
    {{&machine_pin_type}, GPIO_NUM_7}, // Badgelink
    {{NULL}, -1}, // 8
    {{&machine_pin_type}, GPIO_NUM_9}, // Battery ADC
    {{NULL}, -1}, // 10
    {{NULL}, -1}, // 11
    {{NULL}, -1}, // 12
    {{NULL}, -1}, // 13
    {{NULL}, -1}, // 14
    {{NULL}, -1}, // 15
    {{NULL}, -1}, // 16
    {{&machine_pin_type}, GPIO_NUM_17}, // QWIIC
    {{NULL}, -1}, // 18
    {{NULL}, -1}, // 19
    {{NULL}, -1}, // 20
    {{NULL}, -1}, // 21
    {{NULL}, -1}, // 22
    {{NULL}, -1}, // 23
    {{NULL}, -1}, // 24
    {{NULL}, -1}, // 25
    {{NULL}, -1}, // 26
    {{NULL}, -1}, // 27
    {{NULL}, -1}, // 28
    {{NULL}, -1}, // 29
    {{NULL}, -1}, // 30
    {{NULL}, -1}, // 31
    {{NULL}, -1}, // 32
    {{NULL}, -1}, // 33
    {{NULL}, -1}, // 34
    {{NULL}, -1}, // 35
    {{NULL}, -1}, // 36
    {{NULL}, -1}, // 37
    {{NULL}, -1}, // 38
    {{NULL}, -1}, // 39
    {{NULL}, -1}, // 40
    {{NULL}, -1}, // 41
    {{NULL}, -1}, // 42
    {{NULL}, -1}, // 43
    {{NULL}, -1}, // 44
    {{&machine_pin_type}, GPIO_NUM_45}, // QWIIC
    {{NULL}, -1}, // 46

    #elif CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3

