dos1/flow3r-firmware/components/micropython/vendor/ports/esp32/machine_pin.c
    {{&machine_pin_type}, GPIO_NUM_0},
    {{&machine_pin_type}, GPIO_NUM_1},
    {{&machine_pin_type}, GPIO_NUM_2},
    {{&machine_pin_type}, GPIO_NUM_3},
    {{&machine_pin_type}, GPIO_NUM_4},
    {{&machine_pin_type}, GPIO_NUM_5},
    {{&machine_pin_type}, GPIO_NUM_6},
    {{&machine_pin_type}, GPIO_NUM_7},
    {{&machine_pin_type}, GPIO_NUM_8},
    {{&machine_pin_type}, GPIO_NUM_9},
    {{&machine_pin_type}, GPIO_NUM_10},
    {{&machine_pin_type}, GPIO_NUM_11},
    {{&machine_pin_type}, GPIO_NUM_12},
    {{&machine_pin_type}, GPIO_NUM_13},
    {{&machine_pin_type}, GPIO_NUM_14},
    {{&machine_pin_type}, GPIO_NUM_15},
    {{&machine_pin_type}, GPIO_NUM_16},
    {{&machine_pin_type}, GPIO_NUM_17},
    {{&machine_pin_type}, GPIO_NUM_18},
    #if CONFIG_USB_CDC_ENABLED
    {{NULL}, -1}, // 19 is for native USB D-
    {{NULL}, -1}, // 20 is for native USB D-
    #else
    {{&machine_pin_type}, GPIO_NUM_19},
    {{&machine_pin_type}, GPIO_NUM_20},
    #endif
    {{&machine_pin_type}, GPIO_NUM_21},
    {{NULL}, -1}, // 22 not a pin
    {{NULL}, -1}, // 23 not a pin
    {{NULL}, -1}, // 24 not a pin
    {{NULL}, -1}, // 25 not a pin
    #if CONFIG_SPIRAM
    {{NULL}, -1}, // 26 PSRAM
    #else
    {{&machine_pin_type}, GPIO_NUM_26},
    #endif
    {{NULL}, -1}, // 27 FLASH/PSRAM
    {{NULL}, -1}, // 28 FLASH/PSRAM
    {{NULL}, -1}, // 29 FLASH/PSRAM
    {{NULL}, -1}, // 30 FLASH/PSRAM
    {{NULL}, -1}, // 31 FLASH/PSRAM
    {{NULL}, -1}, // 32 FLASH/PSRAM
    #if CONFIG_SPIRAM_MODE_OCT
    {{NULL}, -1}, // 33 FLASH/PSRAM
    {{NULL}, -1}, // 34 FLASH/PSRAM
    {{NULL}, -1}, // 35 FLASH/PSRAM
    {{NULL}, -1}, // 36 FLASH/PSRAM
    {{NULL}, -1}, // 37 FLASH/PSRAM
    #else
    {{&machine_pin_type}, GPIO_NUM_33},
    {{&machine_pin_type}, GPIO_NUM_34},
    {{&machine_pin_type}, GPIO_NUM_35},
    {{&machine_pin_type}, GPIO_NUM_36},
    {{&machine_pin_type}, GPIO_NUM_37},
    #endif
    {{&machine_pin_type}, GPIO_NUM_38},
    {{&machine_pin_type}, GPIO_NUM_39}, // MTCLK
    {{&machine_pin_type}, GPIO_NUM_40}, // MTDO
    {{&machine_pin_type}, GPIO_NUM_41}, // MTDI
    {{&machine_pin_type}, GPIO_NUM_42}, // MTMS
    {{&machine_pin_type}, GPIO_NUM_43}, // U0TXD
    {{&machine_pin_type}, GPIO_NUM_44}, // U0RXD
    {{&machine_pin_type}, GPIO_NUM_45},
    {{&machine_pin_type}, GPIO_NUM_46},

    #endif

    #if CONFIG_IDF_TARGET_ESP32S3 && MICROPY_HW_ESP32S3_EXTENDED_IO

    {{&machine_pin_type}, GPIO_NUM_47},
    {{&machine_pin_type}, GPIO_NUM_48},

    #endif
};

// forward declaration
STATIC const machine_pin_irq_obj_t machine_pin_irq_object[GPIO_NUM_MAX];

void machine_pins_init(void) {
    memset(&MP_STATE_PORT(machine_pin_irq_handler[0]), 0, sizeof(MP_STATE_PORT(machine_pin_irq_handler)));
}

void machine_pins_deinit(void) {
    for (int i = 0; i < MP_ARRAY_SIZE(machine_pin_obj); ++i) {
        if (machine_pin_obj[i].id != (gpio_num_t)-1) {
            gpio_isr_handler_remove(machine_pin_obj[i].id);
        }
    }
}

STATIC void machine_pin_isr_handler(void *arg) {
    machine_pin_obj_t *self = arg;
    mp_obj_t handler = MP_STATE_PORT(machine_pin_irq_handler)[self->id];
    mp_sched_schedule(handler, MP_OBJ_FROM_PTR(self));
    mp_hal_wake_main_task_from_isr();
}

gpio_num_t machine_pin_get_id(mp_obj_t pin_in) {
    if (mp_obj_get_type(pin_in) != &machine_pin_type) {
        mp_raise_ValueError(MP_ERROR_TEXT("expecting a pin"));
    }
    machine_pin_obj_t *self = pin_in;
    return self->id;
}

STATIC void machine_pin_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    machine_pin_obj_t *self = self_in;
    mp_printf(print, "Pin(%u)", self->id);
}

// pin.init(mode=None, pull=-1, *, value, drive, hold)
STATIC mp_obj_t machine_pin_obj_init_helper(const machine_pin_obj_t *self, size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_mode, ARG_pull, ARG_value, ARG_drive, ARG_hold };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_mode, MP_ARG_OBJ, {.u_obj = mp_const_none}},
        { MP_QSTR_pull, MP_ARG_OBJ, {.u_obj = MP_OBJ_NEW_SMALL_INT(-1)}},
        { MP_QSTR_value, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL}},
        { MP_QSTR_drive, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL}},
        { MP_QSTR_hold, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL}},
    };

    // parse args
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    // reset the pin to digital if this is a mode-setting init (grab it back from ADC)
    if (args[ARG_mode].u_obj != mp_const_none) {
        if (rtc_gpio_is_valid_gpio(self->id)) {
            #if !CONFIG_IDF_TARGET_ESP32C3
            rtc_gpio_deinit(self->id);
            #endif
        }
    }

    #if CONFIG_IDF_TARGET_ESP32C3
    if (self->id == 18 || self->id == 19) {
        CLEAR_PERI_REG_MASK(USB_SERIAL_JTAG_CONF0_REG, USB_SERIAL_JTAG_USB_PAD_ENABLE);
    }
    #endif

    // configure the pin for gpio
    esp_rom_gpio_pad_select_gpio(self->id);

    // set initial value (do this before configuring mode/pull)
    if (args[ARG_value].u_obj != MP_OBJ_NULL) {
        gpio_set_level(self->id, mp_obj_is_true(args[ARG_value].u_obj));
    }

    // set drive capability (do this before configuring mode)
    if (args[ARG_drive].u_obj != MP_OBJ_NULL && GPIO_IS_VALID_OUTPUT_GPIO(self->id)) {
        mp_int_t strength = mp_obj_get_int(args[ARG_drive].u_obj);
        if (0 <= strength && strength < GPIO_DRIVE_CAP_MAX) {
            gpio_set_drive_capability(self->id, strength);
        }
    }

    // configure mode
    if (args[ARG_mode].u_obj != mp_const_none) {
        mp_int_t pin_io_mode = mp_obj_get_int(args[ARG_mode].u_obj);
        #ifdef GPIO_FIRST_NON_OUTPUT
        if (self->id >= GPIO_FIRST_NON_OUTPUT && (pin_io_mode & GPIO_MODE_DEF_OUTPUT)) {
            mp_raise_ValueError(MP_ERROR_TEXT("pin can only be input"));
        }
        #endif
        gpio_set_direction(self->id, pin_io_mode);
    }

