dos1/flow3r-firmware/components/micropython/vendor/ports/esp32/machine_pin.c
STATIC MP_DEFINE_CONST_DICT(machine_pin_locals_dict, machine_pin_locals_dict_table);

STATIC const mp_pin_p_t pin_pin_p = {
    .ioctl = pin_ioctl,
};

MP_DEFINE_CONST_OBJ_TYPE(
    machine_pin_type,
    MP_QSTR_Pin,
    MP_TYPE_FLAG_NONE,
    make_new, mp_pin_make_new,
    print, machine_pin_print,
    call, machine_pin_call,
    protocol, &pin_pin_p,
    locals_dict, &machine_pin_locals_dict
    );

/******************************************************************************/
// Pin IRQ object

STATIC const mp_obj_type_t machine_pin_irq_type;

STATIC const machine_pin_irq_obj_t machine_pin_irq_object[GPIO_NUM_MAX] = {
    #if CONFIG_IDF_TARGET_ESP32

    {{&machine_pin_irq_type}, GPIO_NUM_0},
    {{&machine_pin_irq_type}, GPIO_NUM_1},
    {{&machine_pin_irq_type}, GPIO_NUM_2},
    {{&machine_pin_irq_type}, GPIO_NUM_3},
    {{&machine_pin_irq_type}, GPIO_NUM_4},
    {{&machine_pin_irq_type}, GPIO_NUM_5},
    {{&machine_pin_irq_type}, GPIO_NUM_6},
    {{&machine_pin_irq_type}, GPIO_NUM_7},
    {{&machine_pin_irq_type}, GPIO_NUM_8},
    {{&machine_pin_irq_type}, GPIO_NUM_9},
    {{&machine_pin_irq_type}, GPIO_NUM_10},
    {{&machine_pin_irq_type}, GPIO_NUM_11},
    {{&machine_pin_irq_type}, GPIO_NUM_12},
    {{&machine_pin_irq_type}, GPIO_NUM_13},
    {{&machine_pin_irq_type}, GPIO_NUM_14},
    {{&machine_pin_irq_type}, GPIO_NUM_15},
    #if CONFIG_ESP32_SPIRAM_SUPPORT
    {{NULL}, -1},
    {{NULL}, -1},
    #else
    {{&machine_pin_irq_type}, GPIO_NUM_16},
    {{&machine_pin_irq_type}, GPIO_NUM_17},
    #endif
    {{&machine_pin_irq_type}, GPIO_NUM_18},
    {{&machine_pin_irq_type}, GPIO_NUM_19},
    {{&machine_pin_irq_type}, GPIO_NUM_20},
    {{&machine_pin_irq_type}, GPIO_NUM_21},
    {{&machine_pin_irq_type}, GPIO_NUM_22},
    {{&machine_pin_irq_type}, GPIO_NUM_23},
    {{NULL}, -1},
    {{&machine_pin_irq_type}, GPIO_NUM_25},
    {{&machine_pin_irq_type}, GPIO_NUM_26},
    {{&machine_pin_irq_type}, GPIO_NUM_27},
    {{NULL}, -1},
    {{NULL}, -1},
    {{NULL}, -1},
    {{NULL}, -1},
    {{&machine_pin_irq_type}, GPIO_NUM_32},
    {{&machine_pin_irq_type}, GPIO_NUM_33},
    {{&machine_pin_irq_type}, GPIO_NUM_34},
    {{&machine_pin_irq_type}, GPIO_NUM_35},
    {{&machine_pin_irq_type}, GPIO_NUM_36},
    {{&machine_pin_irq_type}, GPIO_NUM_37},
    {{&machine_pin_irq_type}, GPIO_NUM_38},
    {{&machine_pin_irq_type}, GPIO_NUM_39},

    #elif CONFIG_IDF_TARGET_ESP32C3

    {{&machine_pin_irq_type}, GPIO_NUM_0},
    {{&machine_pin_irq_type}, GPIO_NUM_1},
    {{&machine_pin_irq_type}, GPIO_NUM_2},
    {{&machine_pin_irq_type}, GPIO_NUM_3},
    {{&machine_pin_irq_type}, GPIO_NUM_4},
    {{&machine_pin_irq_type}, GPIO_NUM_5},
    {{&machine_pin_irq_type}, GPIO_NUM_6},
    {{&machine_pin_irq_type}, GPIO_NUM_7},
    {{&machine_pin_irq_type}, GPIO_NUM_8},
    {{&machine_pin_irq_type}, GPIO_NUM_9},
    {{&machine_pin_irq_type}, GPIO_NUM_10},
    {{&machine_pin_irq_type}, GPIO_NUM_11},
    {{&machine_pin_irq_type}, GPIO_NUM_12},
    {{&machine_pin_irq_type}, GPIO_NUM_13},
    {{&machine_pin_irq_type}, GPIO_NUM_14},
    {{&machine_pin_irq_type}, GPIO_NUM_15},
    {{&machine_pin_irq_type}, GPIO_NUM_16},
    {{&machine_pin_irq_type}, GPIO_NUM_17},
    {{&machine_pin_irq_type}, GPIO_NUM_18},
    {{&machine_pin_irq_type}, GPIO_NUM_19},
    {{&machine_pin_irq_type}, GPIO_NUM_20},
    {{&machine_pin_irq_type}, GPIO_NUM_21},

	#elif CONFIG_FLOW3R_ESP32S3

    {{NULL}, -1}, // 0
    {{NULL}, -1}, // 1
    {{NULL}, -1}, // 2
    {{NULL}, -1}, // 3
    {{&machine_pin_irq_type}, GPIO_NUM_4}, // Badgelink
    {{&machine_pin_irq_type}, GPIO_NUM_5}, // Badgelink
    {{&machine_pin_irq_type}, GPIO_NUM_6}, // Badgelink
    {{&machine_pin_irq_type}, GPIO_NUM_7}, // Badgelink
    {{NULL}, -1}, // 8
    {{NULL}, -1}, // 9
    {{NULL}, -1}, // 10
    {{NULL}, -1}, // 11
    {{NULL}, -1}, // 12
    {{NULL}, -1}, // 13
    {{NULL}, -1}, // 14
    {{NULL}, -1}, // 15
    {{NULL}, -1}, // 16
    {{&machine_pin_irq_type}, GPIO_NUM_17}, // QWIIC
    {{NULL}, -1}, // 18
    {{NULL}, -1}, // 19
    {{NULL}, -1}, // 20
    {{NULL}, -1}, // 21
    {{NULL}, -1}, // 22
    {{NULL}, -1}, // 23
    {{NULL}, -1}, // 24
    {{NULL}, -1}, // 25
    {{NULL}, -1}, // 26
    {{NULL}, -1}, // 27
    {{NULL}, -1}, // 28
    {{NULL}, -1}, // 29
    {{NULL}, -1}, // 30
    {{NULL}, -1}, // 31
    {{NULL}, -1}, // 32
    {{NULL}, -1}, // 33
    {{NULL}, -1}, // 34
    {{NULL}, -1}, // 35
    {{NULL}, -1}, // 36
    {{NULL}, -1}, // 37
    {{NULL}, -1}, // 38
    {{NULL}, -1}, // 39
    {{NULL}, -1}, // 40
    {{NULL}, -1}, // 41
    {{NULL}, -1}, // 42
    {{NULL}, -1}, // 43
    {{NULL}, -1}, // 44
    {{&machine_pin_irq_type}, GPIO_NUM_45}, // QWIIC
    {{NULL}, -1}, // 46

    #elif CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3

    {{&machine_pin_irq_type}, GPIO_NUM_0},
    {{&machine_pin_irq_type}, GPIO_NUM_1},
    {{&machine_pin_irq_type}, GPIO_NUM_2},
    {{&machine_pin_irq_type}, GPIO_NUM_3},
    {{&machine_pin_irq_type}, GPIO_NUM_4},
    {{&machine_pin_irq_type}, GPIO_NUM_5},
    {{&machine_pin_irq_type}, GPIO_NUM_6},
    {{&machine_pin_irq_type}, GPIO_NUM_7},
    {{&machine_pin_irq_type}, GPIO_NUM_8},
    {{&machine_pin_irq_type}, GPIO_NUM_9},
    {{&machine_pin_irq_type}, GPIO_NUM_10},
    {{&machine_pin_irq_type}, GPIO_NUM_11},
    {{&machine_pin_irq_type}, GPIO_NUM_12},
    {{&machine_pin_irq_type}, GPIO_NUM_13},
    {{&machine_pin_irq_type}, GPIO_NUM_14},
    {{&machine_pin_irq_type}, GPIO_NUM_15},
    {{&machine_pin_irq_type}, GPIO_NUM_16},
    {{&machine_pin_irq_type}, GPIO_NUM_17},
    {{&machine_pin_irq_type}, GPIO_NUM_18},
    #if CONFIG_USB_CDC_ENABLED
    {{NULL}, -1}, // 19 is for native USB D-
    {{NULL}, -1}, // 20 is for native USB D-
    #else
    {{&machine_pin_irq_type}, GPIO_NUM_19},
    {{&machine_pin_irq_type}, GPIO_NUM_20},
    #endif
    {{&machine_pin_irq_type}, GPIO_NUM_21},
    {{NULL}, -1}, // 22 not a pin
    {{NULL}, -1}, // 23 not a pin
    {{NULL}, -1}, // 24 not a pin
    {{NULL}, -1}, // 25 not a pin
    #if CONFIG_SPIRAM
    {{NULL}, -1}, // 26 PSRAM
    #else
    {{&machine_pin_irq_type}, GPIO_NUM_26},
    #endif
    {{NULL}, -1}, // 27 FLASH/PSRAM
    {{NULL}, -1}, // 28 FLASH/PSRAM
    {{NULL}, -1}, // 29 FLASH/PSRAM
    {{NULL}, -1}, // 30 FLASH/PSRAM
    {{NULL}, -1}, // 31 FLASH/PSRAM
    {{NULL}, -1}, // 32 FLASH/PSRAM
    #if CONFIG_SPIRAM_MODE_OCT
    {{NULL}, -1}, // 33 FLASH/PSRAM
    {{NULL}, -1}, // 34 FLASH/PSRAM
    {{NULL}, -1}, // 35 FLASH/PSRAM
    {{NULL}, -1}, // 36 FLASH/PSRAM
    {{NULL}, -1}, // 37 FLASH/PSRAM
    #else
    {{&machine_pin_irq_type}, GPIO_NUM_33},
    {{&machine_pin_irq_type}, GPIO_NUM_34},
    {{&machine_pin_irq_type}, GPIO_NUM_35},
    {{&machine_pin_irq_type}, GPIO_NUM_36},
    {{&machine_pin_irq_type}, GPIO_NUM_37},
    #endif
    {{&machine_pin_irq_type}, GPIO_NUM_38},
    {{&machine_pin_irq_type}, GPIO_NUM_39},
    {{&machine_pin_irq_type}, GPIO_NUM_40},
    {{&machine_pin_irq_type}, GPIO_NUM_41},
    {{&machine_pin_irq_type}, GPIO_NUM_42},
    {{&machine_pin_irq_type}, GPIO_NUM_43},
    {{&machine_pin_irq_type}, GPIO_NUM_44},
    {{&machine_pin_irq_type}, GPIO_NUM_45},
    {{&machine_pin_irq_type}, GPIO_NUM_46},

    #endif

    #if CONFIG_IDF_TARGET_ESP32S3 && MICROPY_HW_ESP32S3_EXTENDED_IO

    {{&machine_pin_irq_type}, GPIO_NUM_47},
    {{&machine_pin_irq_type}, GPIO_NUM_48},

    #endif
};

STATIC mp_obj_t machine_pin_irq_call(mp_obj_t self_in, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    machine_pin_irq_obj_t *self = self_in;
    mp_arg_check_num(n_args, n_kw, 0, 0, false);
    machine_pin_isr_handler((void *)&machine_pin_obj[self->id]);
    return mp_const_none;
}

STATIC mp_obj_t machine_pin_irq_trigger(size_t n_args, const mp_obj_t *args) {
    machine_pin_irq_obj_t *self = args[0];
    uint32_t orig_trig = GPIO.pin[self->id].int_type;
    if (n_args == 2) {
        // set trigger
        gpio_set_intr_type(self->id, mp_obj_get_int(args[1]));
    }
    // return original trigger value
    return MP_OBJ_NEW_SMALL_INT(orig_trig);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_pin_irq_trigger_obj, 1, 2, machine_pin_irq_trigger);

STATIC const mp_rom_map_elem_t machine_pin_irq_locals_dict_table[] = {
    { MP_ROM_QSTR(MP_QSTR_trigger), MP_ROM_PTR(&machine_pin_irq_trigger_obj) },
};
STATIC MP_DEFINE_CONST_DICT(machine_pin_irq_locals_dict, machine_pin_irq_locals_dict_table);

STATIC MP_DEFINE_CONST_OBJ_TYPE(
    machine_pin_irq_type,
    MP_QSTR_IRQ,
    MP_TYPE_FLAG_NONE,
    call, machine_pin_irq_call,
    locals_dict, &machine_pin_irq_locals_dict
    );

MP_REGISTER_ROOT_POINTER(mp_obj_t machine_pin_irq_handler[GPIO_PIN_COUNT]);
